# VVDerivative Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceSecondDerivatives..::..VVDerivative Property
FaceSecondDerivatives Class See Also
---
The second derivative with respect to V.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ VVDerivative { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VVDerivative As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ VVDerivative {
	XYZ^ get ();
}
```

# See Also
FaceSecondDerivatives Class
Autodesk.Revit.DB Namespace